# 1) Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

a = 200
b = 800
m = (a + b) / 2
d = (b - a)**2 / 12
print(f"Среднее значение: {m}. Дисперсия: {d}")